<%-- 
    Document   : start
    Created on : 4 мая 2019 г., 23:11:28
    Author     : ilgizar
--%>
<%@page contentType="text/html"%>
<%@page pageEncoding="UTF-8"%>
<%-- Объявление библиотек тэгов JSF --%>
<%@taglib prefix="f" uri="http://java.sun.com/jsf/core"%>
<%@taglib prefix="h" uri="http://java.sun.com/jsf/html"%>
<!DOCTYPE html>
<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <title>Стартовая страница</title>
    </head>
    <body>
        <p>
        <h1>Практическая часть</h1></br>
            </b><i>1. В зависимости от варианта выполняется разработка web-приложения. Пример
приложения похожего на то, которое нужно разработать, см. выше. Показать работу
приведённого выше примера.</i>
</br><i>2. В целом, нужно создать web-приложение в NetBeans IDE, которое должно состоять
из трёх JSP-страниц – стартовой, главной и финишной, а также при необходимости
использовать для обмена данными между страницами Bean-компоненту.
</br>3. На «Главной странице» инициировать вычисление функции из задания первой
лабораторной работы.
</br>4. Параметры необходимые для работы функции реализуемой на «Главной странице»
задавать на ней в текстовом поле, а результат её работы показывать на «Финишной
странице».
</br>5. Программный код вычисляемой функции разместить: 0 - на «Главной странице».
</br>6. Заголовки страниц должны иметь следующий вид: 0 – «Стартовая страница»,
«Главная страница» и «Финишная страница».
</br>7. Формат «Стартовой страницы»: 0 – содержит текст задания на лабораторную работу,
ФИО студента и ссылку для перехода на «Главную страницу».
</br>8. Организовать вывод результатов работы функции на «Финишной странице»: 0 -
строки следуют одна за другой сверху вниз (таблица без видимых границ, состоящая
из одного столбца и множества строк).
</br>9. При повторном переходе на «Главную страницу», например при нажатии кнопки
«Возврат» на «Финишной странице», на «Главной странице» должно отображаться: 1 – изменение счётчика, размещённого на
«Главной странице»
</br>10. Среди средств автоматизации разработки web-приложения можно выделить
инструмент окно «Палитра» для JSP – страниц и средства реорганизации кода для
класса bean-компоненты, см. рисунки выше.</i>
        </p>
        <h1>Ахметзянов И.И.</h1>
        <a href="jsp_1.jsp">Главная страница</a>
    </body>
</html>
